# many.py
# -*- coding: utf-8 -*-

import random
import time
import threading
from flask import Flask
from telegram import Bot

# 🔹 توکن و آیدی گروه/کانال رو مستقیم اینجا بذار
BOT_TOKEN = "8110670176:AAEAcJD7Z_zqNij9h-6_dG1QiRjPOCQezC0"
CHAT_ID = -1003650512115

# ساخت ربات تلگرام
bot = Bot(token=BOT_TOKEN)

# لیست پیام‌ها (۲۰ پیام چند خطی)
messages = [
    """🙎‍♀کد خانم : ***

🌇شهر سکونت: #ارومیه
📑سن خانم : ۲۳
🚶‍♀وزن و قد خانم: ۵۴/۱۶۷
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۷ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # تهران
📑سن خانم : ۲۳
🚶‍♀قد و وزن خانم: ۱۶۷/۵۹
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : دارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۱۱ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # تبریز
📑سن خانم : ۳۲
🚶‍♀قد و وزن خانم: ۱۷۲/۶۵
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : دارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۱۲ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """ 🙎‍♀کد خانم : ***

🌇شهر سکونت: # اهواز
📑سن خانم : ۲۸
🚶‍♀قد و وزن خانم: ۱۶۲/۶۵
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۶ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # مشهد
📑سن خانم : ۱۹
🚶‍♀قد و وزن خانم: ۱۷۲/۴۹
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه : ۷ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # زنجان
📑سن خانم : ۲۷
🚶‍♀قد و وزن خانم: ۱۷۲/۵۸
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۷ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # اردبیل
📑سن خانم : ۳۱
🚶‍♀قد و وزن خانم: ۱۶۸/۶۱
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : دارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه : ۸ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # اردبیل
📑سن خانم : ۳۱
🚶‍♀قد و وزن خانم: ۱۶۸/۶۱
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : دارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه : ۸ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # ساری
📑سن خانم : ۲۵
🚶‍♀قد و وزن خانم: ۱۷۳/۶۳
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۷ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # سنندج
📑سن خانم : ۲۷
🚶‍♀قد و وزن خانم: ۱۶۴/۵۴
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۵ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # اصفهان
📑سن خانم : ۲۵
🚶‍♀قد و وزن خانم: ۱۶۲/۵۹
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه  ماهانه: ۶ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # شیراز
📑سن خانم : ۳۰
🚶‍♀قد و وزن خانم: ۱۷۰/۶۱
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : دارد
😷کارت بهداشت و سلامت: دارد
💵مهریه  ماهانه: ۱۱ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # چابهار 
📑سن خانم : ۳۲
🚶‍♀قد و وزن خانم: ۱۶۴/۵۴
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : دارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۱۱ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # کرمان
📑سن خانم : ۲۶
🚶‍♀قد و وزن خانم: ۱۶۷/۵۲
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۶ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # زاهدان 
📑سن خانم : ۳۴
🚶‍♀قد و وزن خانم: ۱۷۲/۶۵
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : دارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۱۳ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # بیرجند 
📑سن خانم : ۲۳
🚶‍♀قد و وزن خانم: ۱۷۹/۴۹
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۸ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # سیرجان
📑سن خانم : ۲۵
🚶‍♀قد و وزن خانم: ۱۷۴/۵۴
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : ندارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۷ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,

    """🙎‍♀کد خانم : ***

🌇شهر سکونت: # قزوین 
📑سن خانم : ۲۸
🚶‍♀قد و وزن خانم: ۱۷۲/۶۰
✅وضعیت خانم : مطلقه
🏠مسکن جهت رابطه : دارد
😷کارت بهداشت و سلامت: دارد
💵مهریه ماهانه: ۸ میلیون تومان
💵هزینه معرفی : ۵۰۰ تومن
✅مدیریت موسسه ساهره
✅ارتباط با ادمین: 
@Sigheh_sahereh
    """,
     ]

# تابع ارسال پیام تصادفی
def send_random_message():
    while True:
        message = random.choice(messages)
        try:
            bot.send_message(chat_id=CHAT_ID, text=message)
            print("پیام ارسال شد ✅")
        except Exception as e:
            print(f"خطا در ارسال پیام: {e}")
        time.sleep(3600)  # هر یک ساعت

# اجرای Flask برای زنده نگه داشتن سرویس روی Render
app = Flask(__name__)

@app.route("/")
def home():
    return "Bot is running ✅"

if __name__ == "__main__":
    # اجرای ربات در یک Thread جدا
    t = threading.Thread(target=send_random_message)
    t.start()

    # اجرای وب‌سرور
    app.run(host="0.0.0.0", port=5000)